llm_evaluation_prompt = """你是一个公正的裁判者，擅长分析人工智能助手的回复质量。

我将给你提供一个用户指令、一个用户指令中包含的要求、一个人工智能助手对于用户指令的回复、以及一个计数目标清单。请你仔细思考，认真分析人工智能助手的回复是否满足了用户指令的对应要求，并说明原因，无需改写人工智能助手的回复。我还同时提供了对于对应要求的，使用辅助验证代码自动计算得到的部分参考信息（可能为空），你应该慎重地参考这些信息做出最终判断，并给出每个计数目标的计数结果。需要注意的是，辅助验证代码具有局限性，因此其给出的参考信息并不保证完全正确，可能存在错误。如果你有把握认为参考信息存在明显错误，你可以选择不使用这些参考信息。切记以下事项：
1. 你的判断应该尽量严格。仅在回复完全满足了对应要求中的所有内容时，才可判断为 [[人工智能助手的回复满足了该要求]]，如果回复在完成要求时出现任何遗漏、错误，都应该判断为 [[人工智能助手的回复没有满足该要求]]。
2. 你对于对应要求的判断应该保持独立，在判断当前要求的满足情况时，不需要考虑用户指令的其他部分的满足情况。
3. 你在进行判断时还应该遵循如下细则：
    a. 对于类似“X字”，“X字左右”等给出单一字数而非明确字数区间的要求时，仅在实际字数在要求字数X的90%-110%时判断为满足。但对于类似“不少于X字”，“不多于X字”等给出明确字数区间的要求时，仅在实际字数在要求字数区间内时判断为满足。“X个以上”，“X个以下”原则上不包括本数，下同。但如果指令中特别强调了回复必须精确地满足某一字数，则必须回复实际字数和要求字数完全相等才可判断为满足。
    b. 对于句子的划分，一般以句末标点（句号、问号、感叹号、省略号、换行等）进行划分，逗号、分号等不代表句子的结束。回复可能使用其他划分方式，或者将上述符号使用在其他位置（例如将英文句号用在有序列表），你需要根据具体情况适当调整。特别注意：**单独成行的标题不计入句子或段落，其属于该段落第一句的一部分**。
    c. 统计标点（例如冒号、问号、句号等）的数量时，若无特殊说明，中英文的该类标点均需要纳入统计。
    d. 对于书名号、括号、中文引号等左右对称的标点符号，必须是其左右部分各出现一次时才记该标点出现一次。
4. 在给出判断结果后，请你结合参考信息和你自己的判断，针对计数目标清单的每一项给出计数结果，包含计数目标、要求数量、实际数量三部分。在给出计数结果时，需要注意以下原则：
    a. 你应该特别注意区分计数目标类型是全称还是特称。对于特称的计数目标，你应该使用计数目标原文。但对于全称的计数目标，你不应该直接使用计数目标原文，而应该列举出回复中存在的每一项的计数结果。例如，对于要求"回复每一段的字数"这一全称的计数目标，你应该针对回复的每一段返回一项计数结果，即"回复第1段字数"，"回复第2段字数"，...；对于要求"所有展现你我二人核心情感互动的句子字数"这一全称的计数目标，你应该针对回复中每一符合该要求的句子返回一项计数结果，即"第1句展现你我二人核心情感互动的句子字数"，"第2句展现你我二人核心情感互动的句子字数"，...
    c. 你只需要给出计数目标清单中每一项的计数结果，不需要给出任何其他计数结果。
5. 部分要求数量并非通过具体数字给出，而是通过和某些参考值的相对数量关系表示的，例如大于小于关系或者数量运算关系。此时，你必须首先统计出参考值，然后将该值带入要求数量中，不应该直接写成[0, \"inf\"]或者[\"-inf\", \"inf\"]。例如，对于要求"回复中感叹句的数量多于陈述句的数量。"，计数目标设置为"感叹句的数量"，你应该先统计出陈述句的数量 c，要求数量设置为 [c + 1, \"inf\"]；对于要求"全文中换行符的总个数乘以2恰好等于中文分号的总个数加上中文问号的总个数之和"，"全文中换行符的总个数乘以2"作为计数目标，你应该先统计出回复中文分号的总个数加上中文问号的总个数之和 c，要求数量设置为 [c, c]。
6. 你必须保证你给出的结论和计数结果逻辑一致，即：如果你的判断的结果为 [[人工智能助手的回复满足了该要求]]，则计数结果的每一项的实际数量应该在要求数量范围内；如果你的判断结果为 [[人工智能助手的回复没有满足该要求]]，则计数结果中至少一项的实际数量不在要求数量范围内。部分计数目标的要求数量并未显式给出，你应该结合要求和回复内容进行仔细分析确定。
7. 再次强调，辅助验证代码具有局限性，因此其给出的参考信息并不保证完全正确，可能存在错误。如果你有把握认为参考信息存在明显错误，你可以选择不使用这些参考信息。


你必须严格按照以下格式，输出对需要判断的要求的分析与判断：
```
要求：...（此处直接给出对应要求原文，不能进行任何修改）
分析：...（此处结合回复的具体内容，给出详细的、逐步的、细致的分析过程，分析人工智能助手的回复是否满足了该要求）
结论：此处只能是 [[人工智能助手的回复满足了该要求]] 或 [[人工智能助手的回复没有满足该要求]]
计数结果：```json
[
    {{
        "计数目标" : ...（字符串，详细描述该要求子项的计数目标，对于特称的计数目标，你应该使用计数目标原文。但对于全称的计数目标，你不应该直接使用计数目标原文，而应该列举出回复中存在的每一项计数结果）,
        "要求数量" : ...（包含两个数的列表，给出形如 [a, b] 的数量约束闭区间，仅有一个可行值时允许左右端点相等，正无穷和负无穷分别用"\"inf\""和"\"-inf\""表示。对于其他二值判断的要求，要求数量可设置为 [0, 0] 或者 [1, 1]。特别注意由参考值的相对数量关系表示的要求，需要将参考值带入要求数量中）,
        "实际数量" : ...（整数，给出回复中实际数量值）,
    }},
    ...
]
```
```

    
下面是我给你提供的用户指令、对应要求与人工智能助手的回复：
[用户指令-开始]
{prompt}
[用户指令-结束]

[需要判断的要求-开始]
{checklist}
[需要判断的要求-结束]

[辅助验证结果-开始]
{results}
[辅助验证结果-结束]

[人工智能助手的回复-开始]
{response}
[人工智能助手的回复-结束]

[计数目标清单-开始]
{plan}
[计数目标清单-结束]"""
