code_evaluation_prompt = """你是一个公正的裁判者，擅长分析人工智能助手的回复质量。我将给你提供一个用户指令，一个用户指令中包含的给定要求，一个人工智能助手的回复，以及一个计数目标清单。我的目标是判断该人工智能助手的回复是否满足了该要求，请你针对该要求生成Python格式的辅助验证代码帮助我更准确地进行判断。你在完成该任务时必须遵循以下原则：
1. “辅助验证”的含义是使用代码自动、准确地获取回复中的部分重要的、客观的信息，以方便后续的评测模型对该要求的满足情况进行更准确的判断，而非直接使用代码获取该要求是否满足的判断结果。
2. 生成的“辅助验证代码”必须符合如下要求：
    a. 只能针对字数、关键词句出现数量、格式等完全客观的要求生成“辅助验证代码”；任何带有主观性的要求，如关于内容、风格、主题的要求不需要，也不应该使用代码辅助验证。但同时注意，对于客观要求，也并非都需要使用代码辅助验证。
    b. “辅助验证代码”所计算得到的信息必须具有绝对的排他性和确定性，回复满足和不满足该要求时计算得到的信息必须具有显著差异。不能取决于任何假定或假设，不能计算任何具有模糊性、不确定性的结果作为要求是否满足的判断依据。例如，不能通过匹配部分关键词的方法，判断回复是否属于某一主题，因为回复可以在不使用列表中关键词的情况下通过不同方式表达相同的主题。在任何情况下，如果不能有把握地通过“辅助验证代码”计算得到具有绝对排他性和确定性的信息，即存在回复满足和不满足该要求时计算得到相同结果的可能性时，均应该选择不生成辅助验证代码。
    c. “辅助验证代码”中计算得到的信息应该尽量覆盖，但不局限于“计数目标清单”。但对于清单中存在主观性，或者代码难以准确计算的计数目标，允许不计算对应结果。同时，你也可以自由地计算清单之外你认为必要的其他内容。
3. “辅助验证代码”必须是一个Python函数，在该函数中：
    a. 函数的传入参数由你自行设计确定，但其内容必须是回复中和要求相关的片段。如果要求仅作用在回复的部分片段，你应该使用尽量具体的回复片段作为传入参数，避免直接以整个回复作为输入并在代码内部进行片段切分。
    b. 函数的返回值必须是列表格式，列表的每一项是一个Dict，包含该辅助验证代码获取得到的某一类重要信息。每一个Dict的形式如下：
        ```
        {{
            "描述" : ...（字符串，详细描述代码获取得到的该信息的定义，方便评测模型理解并参考该信息）
            "计算结果" : ...（格式不限，给出提取得到的信息）,
        }}
        ```
    c. 函数中所有需要import的Python包必须实现在函数内部，不允许使用任何需要额外下载的Python包。 
4. 统计字 / 字数 / 词数，或者划分句子时，为了保证标准统一，你应该直接使用下列人类专家已经实现的函数（要求中有特殊说明时除外，例如仅统计英文 / 中文字符。使用时直接在代码中引用，不需要重新实现，不需要import）：
    a. count_word(s: str) -> int : 统计某一字符串的字 / 字数 / 词数（仅在要求中明确说明“字符数“时才使用len函数），传入参数为该字符串，返回值为整数类型的统计结果；
    b. split_sentences(s: str) -> List : 将某一字符串分句，传入参数为该字符串，返回值为列表类型的该字符串的每个句子。
5. 对于数量统计存在如下细则：
    a. 对于句子的划分，一般以句末标点（句号、问号、感叹号、省略号、换行等）进行划分，逗号、分号等不代表句子的结束。回复可能使用其他划分方式，或者将上述符号使用在其他位置（例如将英文句号用在有序列表），你需要根据具体情况适当调整。特别注意：**单独成行的标题不计入句子或段落，其属于该段落第一句的一部分**。
    b. 统计标点（例如冒号、问号、句号等）的数量时，若无特殊说明，中英文的该类标点均需要纳入统计。
    c. 对于书名号、括号、中文引号等左右对称的标点符号，必须是其左右部分各出现一次时才记该标点出现一次。
    d. 再次强调，注意区分“字 / 字数 / 词数”和“字符数”，前者并非指字符数。仅在要求中明确说明统计“字符数“时，才使用len函数进行统计，其他情况原则上均应该使用count_word函数统计。
6. 如果你选择生成了辅助验证代码，则你还需要抽取出该人工智能助手的回复中各参数对应的值，必须遵循以下原则：
    a. 你只能抽取回复中连续的原文片段，严禁做任何修改、增添、删除、拼接，只能进行整段的复制；
    b. 如果某一参数对应的抽取结果是完整的回复，你应该输出"ALL"代替，不需要输出回复的完整内容；如果回复中没有某一参数对应的抽取结果，你应该输出""代替。

 
输出格式如下：
```
[辅助验证代码-开始]
```python
...（你需要给出能辅助验证该要求的Python格式代码，具体要求如上。如果你选择不生成辅助验证代码，在此处输出“无”即可）
```
[辅助验证代码-结束]

[传入参数定义-开始]
...（你需要详细给出你设计的辅助验证代码每个传入参数的名称、格式、描述、值，顺序与辅助验证代码中一致，按照下列json格式输出。如果你选择不生成辅助验证代码，在此处输出“无”即可）
```json
[
    {{
        "参数名": ...(给出第一个参数名称，和辅助验证代码中一致),
        "格式": ...(给出第一个参数格式，例如str，List),
        "参数描述" : ...(给出第一个参数描述和含义),
        "参数值": ...（此处直接给出第一个参数在人工智能助手的回复中对应的值。必须是回复的完整原文片段，不能做任何更改。其格式必须和输入参数描述中一致）
    }},
    {{
        "参数名": ...(给出第二个参数名称，和辅助验证代码中一致),
        "格式": ...(给出第二个参数格式，例如str，List),
        "参数描述" : ...(给出第二个参数描述和含义),
        "参数值": ...（此处直接给出第二个参数在人工智能助手的回复中对应的值。必须是回复的完整原文片段，不能做任何更改。其格式必须和输入参数描述中一致）
    }},
    ...
]
```
[传入参数定义-结束]
```


下面是我给你提供的用户指令，一个用户指令中包含的要求，以及人工智能助手的回复：
[用户指令-开始]
{prompt}
[用户指令-结束]

[给定要求-开始]
{checklist}
[给定要求-结束]

[人工智能助手的回复-开始]
{response}
[人工智能助手的回复-结束]

[计数目标清单-开始]
{plan}
[计数目标清单-结束]"""
