target_validation_prompt = """你是一个专业的人工智能专家，精通机器学习和自然语言处理技术，擅长判断用户指令的质量。我将给你提供一个用户指令，一个用户指令中包含的给定要求，以及该要求对应的计数目标。你的任务是仔细分析该计数目标是否完全正确，符合下列所有条件，最终给出"[[高质量]]"或者"[[低质量]]"的判断结论。高质量的计数目标需要满足下列所有条件，而不满足下列任意条件的计数目标都应该判断为低质量。
1. 计数目标的每一项的统计结果都可以使用数字，或者“是/否”表示。例如，【第二段的最后一个单词】的统计结果不可以使用数字表示，不属于正确的计数目标；【第二段的最后一个单词中"good"的出现次数】的统计结果可以用数字表示，属于正确的计数目标；【是否回复的结尾是'今天是美好的一天。'】的统计结果可以用“是/否”表示，属于正确的计数目标。
2. 计数目标的每一项"全称"和"特称"区分正确，"全称"指该子项作用于数量不定的多个目标，而"特称"指该子项作用于仅一个特定目标，不能像"四个自然段的字数"这样对应多个统计结果。在计数目标中应该给出每一个子项的类型。例如：
    a. 对于要求"回复每一段均在200-250字。"，作用于回复中的每一个段落，因此其属于全称；
    b. 对于要求“回复第一段在200-250字。”，作用于回复中的第一个段落，因此其属于特称；
    c. 对于要求"所有展现你我二人核心情感互动的句子字数控制在15到22字区间内。"，作用于回复中每一个符合该条件的句子，因此其属于全称；
    d. 对于要求"所有描述系统核心业务模块的句子的平均字数少于50字。"，作用于回复中所有句子的平均字数，仅平均字数一个目标，因此其属于特称。
3. 对于要求数量并非用具体数字而是用另一个参考对象的数量表示的要求，取该要求的主语部分作为计数目标，参考值不作为计数目标。例如：
    a. 对于要求"回复中感叹句的数量多于陈述句的数量。"，仅"回复中感叹句的数量"作为计数目标，"陈述句的数量"不作为计数目标；
    b. 对于要求"全文中换行符的总个数乘以2恰好等于中文分号的总个数加上中文问号的总个数之和"，仅"全文中换行符的总个数乘以2"作为计数目标，"中文分号的总个数加上中文问号的总个数之和"不作为计数目标；
    c. 对于要求"所有以感叹号结尾的句子中，“合规”这一关键词的出现总次数，与所有以问号结尾的句子中“疏漏”这一关键词的出现总次数加1之后的数值完全相等"，仅"所有以感叹号结尾的句子中，“合规”这一关键词的出现总次数"作为计数目标，"所有以问号结尾的句子中“疏漏”这一关键词的出现总次数加1之后的数值"不作为计数目标。
4. 计数目标和给定要求内容一一对应，该给定要求的每一个子项都有对应的计数目标，同时计数目标中不存在任何和该要求无关的内容。换言之，该计数目标的每一项都在要求范围内，是该给定要求满足的充分必要条件。例如，对于要求【回答需划分为三个独立部分：逻辑框架阐释、路径举措说明、落地保障建议，三个部分中第一部分和第三部分的字数相等，第二部分的字数需为第一部分字数的1.2倍到1.5倍之间。】，仅以三部分的字数作为计数目标是不正确的，因为其没有验证回复的三个部分的内容是否恰好为"逻辑框架阐释、路径举措说明、落地保障建议"。特别注意：
    a. 计数目标需要和给定要求一一对应，而不是和整个用户指令对应。计数目标不需要覆盖给定要求之外用户指令中的其他数量要求；
    b. 和条件3对应，对于要求数量并非用具体数字而是用另一个参考对象的数量表示的要求，取该要求的主语部分作为计数目标，参考值不作为计数目标。因此，正确的计数目标不应该包含参考值。
5. 对于给出多条规则，要求满足若干条的要求，计数目标应当为满足要求的条数，而非若干条要求的具体内容。因为这些要求不一定需要全部满足，不应该将其直接作为计数目标。例如对于要求"短文中出现的每个字符，都必须至少满足以下四条中的三条：XX"，对应计数目标为"短文中出现的每个字符，以下四条中满足的条数"；对于要求"满足以下五项规范中的恰好三项：XX"，对应计数目标为"以下五项规范中满足的项数"。


严格遵循以下格式输出你的分析与结论。
```
分析：...（首先给出完整的、全面的、详细的、细致的分析）
最终结论：最终结论只能是“[[高质量]]”或“[[低质量]]”。
```

下面是我给你提供的用户指令、用户指令中包含的给定要求、以及计数目标：
[用户指令-开始]
{prompt}
[用户指令-结束]

[给定要求-开始]
{checklist}
[给定要求-结束]

[计数目标-开始]
{targets}
[计数目标-结束]
"""
